app/controllers/pets_controller.rb

  def create
   @pet = current_user.pets.build(pet_params)

   respond_to do |format|
     if @pet.save
---
INSERT INTO "pets" ("birthday", "category", "created_at", "name", "sex", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["birthday", "2013-05-04"], ["category", "cat"], ["created_at", "2016-02-04 19:45:18.623584"], ["name", "EStrella"], ["sex", "male"], ["updated_at", "2016-02-04 19:45:18.623584"], ["user_id", 2]]

  def update

    respond_to do |format|
      if @pet.update(pet_params)
---
UPDATE "pets" SET "category" = ?, "sex" = ?, "updated_at" = ? WHERE "pets"."id" = 1  [["category", "cat"], ["sex", "male"], ["updated_at", "2016-02-04 19:53:50.959750"]]

  def destroy
    respond_to do |format|
      if @pet.user != current_user
        format.html { redirect_to @pet, notice: 'Cannot destroy because you are not the owner.' }
      else
          @pet.destroy
---
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 1]]